In [1]:
import pandas as pd
import numpy as np

# series-list

In [2]:
pd.Series([10,20,30,40,50])

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
list_data = [2,4,6,8,10]
list_index = ["a","b","c","d","e"]

In [4]:
veriable = pd.Series(data = list_data,index = list_index,dtype="int")

In [5]:
veriable

a     2
b     4
c     6
d     8
e    10
dtype: int32

# series-dict

In [6]:
dictionary = {"ferrari": 334.7,"porche":337.9,"lamborgini":349}

In [7]:
dictionary

{'ferrari': 334.7, 'porche': 337.9, 'lamborgini': 349}

In [8]:
pd.Series(dictionary)

ferrari       334.7
porche        337.9
lamborgini    349.0
dtype: float64

In [9]:
pd.Series(data = dictionary)

ferrari       334.7
porche        337.9
lamborgini    349.0
dtype: float64

In [10]:
veriable = pd.Series(data = dictionary,index = ["porche","bugatti","ferrari"])

In [11]:
veriable

porche     337.9
bugatti      NaN
ferrari    334.7
dtype: float64

# series-array

In [12]:
example = np.array([1,3.3,5,7.2,9])
labels = np.array(["a","b","c","d","e"])

In [13]:
veriable = pd.Series(data = example,index=labels)

In [14]:
veriable

a    1.0
b    3.3
c    5.0
d    7.2
e    9.0
dtype: float64

In [15]:
example = pd.Series(["word",100,5.8,False])

In [16]:
example[0]

'word'

In [17]:
print(type(example[0]))
print(type(example[1]))
print(type(example[2]))
print(type(example[3]))

<class 'str'>
<class 'int'>
<class 'float'>
<class 'bool'>

In [18]:
pd.Series([sum,type,max,min])

0    <built-in function sum>
1             <class 'type'>
2    <built-in function max>
3    <built-in function min>
dtype: object

In [19]:
example = pd.Series([10,20,30,40,50,60,70])

In [20]:
example.axes

[RangeIndex(start=0, stop=7, step=1)]

In [21]:
example.dtype

dtype('int64')

In [22]:
example.size

7

In [23]:
example.ndim

1

In [24]:
example.shape

(7,)

In [25]:
example.head()

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [26]:
example.tail

<bound method NDFrame.tail of 0    10
1    20
2    30
3    40
4    50
5    60
6    70
dtype: int64>

In [27]:
example.tail(3)

4    50
5    60
6    70
dtype: int64

In [28]:
veriable = pd.Series([8,3,6,5,1],index = ["b","d","c","a","e"])

In [29]:
veriable

b    8
d    3
c    6
a    5
e    1
dtype: int64

In [30]:
new_veriable = veriable.sort_index

In [31]:
new_veriable1 = veriable.sort_values

In [32]:
veriable

b    8
d    3
c    6
a    5
e    1
dtype: int64

In [33]:
new_veriable

<bound method Series.sort_index of b    8
d    3
c    6
a    5
e    1
dtype: int64>

In [34]:
new_veriable1

<bound method Series.sort_values of b    8
d    3
c    6
a    5
e    1
dtype: int64>

In [35]:
veriable.isin([6,1])

b    False
d    False
c     True
a    False
e     True
dtype: bool

In [36]:
veriable[veriable.isin([6,1])]

c    6
e    1
dtype: int64

In [37]:
veriable.values

array([8, 3, 6, 5, 1], dtype=int64)

In [38]:
[i for i in veriable.values]

[8, 3, 6, 5, 1]

In [39]:
veriable.index

Index(['b', 'd', 'c', 'a', 'e'], dtype='object')

In [40]:
[i for i in veriable.index]

['b', 'd', 'c', 'a', 'e']

In [41]:
veriable.items

<bound method Series.items of b    8
d    3
c    6
a    5
e    1
dtype: int64>

In [42]:
list(veriable.items())

[('b', 8), ('d', 3), ('c', 6), ('a', 5), ('e', 1)]

In [43]:
example = pd.Series(["+90","+49","+33","+39","+46","+47"],index = ["Turkey","Germany","France","Italy","Sweden","Norway"])

In [44]:
example

Turkey     +90
Germany    +49
France     +33
Italy      +39
Sweden     +46
Norway     +47
dtype: object

In [45]:
example["Germany"]

'+49'

In [46]:
example[1]

'+49'

In [47]:
example["Germany":"France"]

Germany    +49
France     +33
dtype: object

# Dataframe

In [48]:
list_example = [5,10,15,20,25]

In [49]:
list_example

[5, 10, 15, 20, 25]

In [50]:
pd.DataFrame(data = list_example,columns=["values"],dtype="float")

   values
0     5.0
1    10.0
2    15.0
3    20.0
4    25.0

In [51]:
array_example = np.random.randint(0,50,(4,4))

In [52]:
array_example

array([[35, 41, 32,  6],
       [35, 11, 42, 30],
       [49, 18, 13, 21],
       [ 5, 17, 25, 42]])

In [53]:
df = pd.DataFrame(data = array_example,index=["a","b","c","d"])

In [54]:
df

    0   1   2   3
a  35  41  32   6
b  35  11  42  30
c  49  18  13  21
d   5  17  25  42

In [55]:
df = pd.DataFrame(data = array_example,index=["a","b","c","d"],columns=["1","2","3","4"])

In [56]:
df

    1   2   3   4
a  35  41  32   6
b  35  11  42  30
c  49  18  13  21
d   5  17  25  42

In [57]:
x = np.random.randint(10,50,size=6)
y = np.random.randint(10,50,size=6)
z = np.random.randint(10,50,size=6)
t = np.random.randint(10,50,size=6)

In [58]:
dict_example = {"val1":x,"val2":y,"val3":z,"val4":t}

In [59]:
dict_example

{'val1': array([13, 26, 31, 43, 36, 45]),
 'val2': array([47, 13, 39, 49, 35, 25]),
 'val3': array([14, 49, 48, 29, 47, 30]),
 'val4': array([29, 10, 38, 42, 32, 23])}

In [60]:
df = pd.DataFrame(dict_example)

In [61]:
df

   val1  val2  val3  val4
0    13    47    14    29
1    26    13    49    10
2    31    39    48    38
3    43    49    29    42
4    36    35    47    32
5    45    25    30    23

In [62]:
df.head()

   val1  val2  val3  val4
0    13    47    14    29
1    26    13    49    10
2    31    39    48    38
3    43    49    29    42
4    36    35    47    32

In [63]:
df.tail()

   val1  val2  val3  val4
1    26    13    49    10
2    31    39    48    38
3    43    49    29    42
4    36    35    47    32
5    45    25    30    23

In [64]:
df.columns

Index(['val1', 'val2', 'val3', 'val4'], dtype='object')

In [65]:
[i for i in df.columns]

['val1', 'val2', 'val3', 'val4']

In [66]:
df.columns = ["new1","new2","new3","new4"]

In [67]:
df.values

array([[13, 47, 14, 29],
       [26, 13, 49, 10],
       [31, 39, 48, 38],
       [43, 49, 29, 42],
       [36, 35, 47, 32],
       [45, 25, 30, 23]])

In [68]:
type(df.values)

numpy.ndarray

In [69]:
type(df)

pandas.core.frame.DataFrame

In [70]:
df.shape

(6, 4)

In [71]:
df.ndim

2

In [72]:
df.size

24

# Ä°NDEXLEME

In [73]:
np.random.seed(101)

In [74]:
df = pd.DataFrame(data = np.random.randn(6,5), index = "A B C D E F".split(),columns=["VAL1 VAL2 VAL3 VAL4 VAL5".split()])

In [75]:
df

       VAL1      VAL2      VAL3      VAL4      VAL5
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841
F  0.390528  0.166905  0.184502  0.807706  0.072960

In [76]:
df["VAL1"]

       VAL1
A  2.706850
B -0.319318
C  0.528813
D  0.955057
E  0.302665
F  0.390528

In [77]:
df.VAL1

       VAL1
A  2.706850
B -0.319318
C  0.528813
D  0.955057
E  0.302665
F  0.390528

In [78]:
df["VAL1"].values

array([[ 2.70684984],
       [-0.31931804],
       [ 0.52881349],
       [ 0.95505651],
       [ 0.30266545],
       [ 0.39052784]])

In [79]:
df[["VAL1"]]

       VAL1
A  2.706850
B -0.319318
C  0.528813
D  0.955057
E  0.302665
F  0.390528

In [80]:
df[["VAL1"]]["B":"D"]

       VAL1
B -0.319318
C  0.528813
D  0.955057

In [81]:
df[["VAL1"]][1:4]

       VAL1
B -0.319318
C  0.528813
D  0.955057

In [82]:
df[["VAL2","VAL5"]]

       VAL2      VAL5
A  0.628133  0.651118
B -0.848077  0.740122
C -0.589001 -0.933237
D  0.190794  0.683509
E  1.693723 -0.134841
F  0.166905  0.072960

In [83]:
variable = ["VAL3","VAL5"]

In [84]:
df[variable]

       VAL3      VAL5
A  0.907969  0.651118
B  0.605965  0.740122
C  0.188695 -0.933237
D  1.978757  0.683509
E -1.706086 -0.134841
F  0.184502  0.072960

In [85]:
df["B":"D"]

       VAL1      VAL2      VAL3      VAL4      VAL5
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509

In [86]:
df[1:4]

       VAL1      VAL2      VAL3      VAL4      VAL5
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509

In [87]:
df

       VAL1      VAL2      VAL3      VAL4      VAL5
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841
F  0.390528  0.166905  0.184502  0.807706  0.072960

In [88]:
df[0:4]

       VAL1      VAL2      VAL3      VAL4      VAL5
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509

In [89]:
df[0:4]["VAL1"]

       VAL1
A  2.706850
B -0.319318
C  0.528813
D  0.955057

In [90]:
df["E":"E"]

       VAL1      VAL2      VAL3      VAL4      VAL5
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [91]:
df["E":"E"][["VAL2","VAL5"]]

       VAL2      VAL5
E  1.693723 -0.134841

# LOC, Ä°LOC

In [92]:
np.random.seed(10)

array = np.random.randint(10,50,(10,5))
df1 = pd.DataFrame(data=array,index="A B C D E F G H I J".split(),columns="VAL1 VAL2 VAL3 VAL4 VAL5".split())

In [93]:
df1

   VAL1  VAL2  VAL3  VAL4  VAL5
A    19    46    25    10    38
B    35    39    39    18    19
C    10    46    26    46    21
D    34    43    18    46    24
E    23    15    23    35    23
F    38    32    40    40    35
G    22    11    41    46    37
H    28    39    23    32    33
I    40    21    38    20    34
J    19    25    28    26    17

In [94]:
np.random.seed(101)

array = np.random.randint(10,50,(10,5))
df = pd.DataFrame(data=array,index="A B C D E F G H I J".split(),columns="VAL1 VAL2 VAL3 VAL4 VAL5".split())

In [95]:
df

   VAL1  VAL2  VAL3  VAL4  VAL5
A    41    21    27    16    33
B    21    19    23    14    38
C    10    15    22    39    29
D    18    39    44    18    29
E    20    22    41    33    10
F    19    18    46    29    45
G    38    17    20    49    48
H    19    28    17    49    25
I    10    22    27    21    25
J    43    39    34    46    29

In [96]:
df.loc["A":"D"]

   VAL1  VAL2  VAL3  VAL4  VAL5
A    41    21    27    16    33
B    21    19    23    14    38
C    10    15    22    39    29
D    18    39    44    18    29

In [97]:
df.loc["C":"I"]

   VAL1  VAL2  VAL3  VAL4  VAL5
C    10    15    22    39    29
D    18    39    44    18    29
E    20    22    41    33    10
F    19    18    46    29    45
G    38    17    20    49    48
H    19    28    17    49    25
I    10    22    27    21    25

In [98]:
df.iloc[1:4]

   VAL1  VAL2  VAL3  VAL4  VAL5
B    21    19    23    14    38
C    10    15    22    39    29
D    18    39    44    18    29

In [99]:
df.loc["C","VAL4"]

39

In [100]:
df.iloc[2,3]

39

In [101]:
df.loc["C":"G","VAL3"]

C    22
D    44
E    41
F    46
G    20
Name: VAL3, dtype: int32

In [102]:
df.loc["C":"G",["VAL3"]]

   VAL3
C    22
D    44
E    41
F    46
G    20

In [103]:
df.loc["C":"G"][["VAL3"]]

   VAL3
C    22
D    44
E    41
F    46
G    20

In [104]:
df.iloc[2:7,2]

C    22
D    44
E    41
F    46
G    20
Name: VAL3, dtype: int32

In [105]:
df.iloc[2:7]["VAL2"]

C    15
D    39
E    22
F    18
G    17
Name: VAL2, dtype: int32

In [106]:
df.iloc[2:7][["VAL2"]]

   VAL2
C    15
D    39
E    22
F    18
G    17

In [107]:
df.loc["C":"H","VAL2":"VAL4"]

   VAL2  VAL3  VAL4
C    15    22    39
D    39    44    18
E    22    41    33
F    18    46    29
G    17    20    49
H    28    17    49

In [108]:
df.iloc[2:8,1:4]

   VAL2  VAL3  VAL4
C    15    22    39
D    39    44    18
E    22    41    33
F    18    46    29
G    17    20    49
H    28    17    49

In [109]:
df.iloc[2:8,1:4].loc["E":"F",["VAL3"]]

   VAL3
E    41
F    46

In [110]:
df > 20

    VAL1   VAL2   VAL3   VAL4   VAL5
A   True   True   True  False   True
B   True  False   True  False   True
C  False  False   True   True   True
D  False   True   True  False   True
E  False   True   True   True  False
F  False  False   True   True   True
G   True  False  False   True   True
H  False   True  False   True   True
I  False   True   True   True   True
J   True   True   True   True   True

In [111]:
df[df > 20]

   VAL1  VAL2  VAL3  VAL4  VAL5
A  41.0  21.0  27.0   NaN  33.0
B  21.0   NaN  23.0   NaN  38.0
C   NaN   NaN  22.0  39.0  29.0
D   NaN  39.0  44.0   NaN  29.0
E   NaN  22.0  41.0  33.0   NaN
F   NaN   NaN  46.0  29.0  45.0
G  38.0   NaN   NaN  49.0  48.0
H   NaN  28.0   NaN  49.0  25.0
I   NaN  22.0  27.0  21.0  25.0
J  43.0  39.0  34.0  46.0  29.0

In [112]:
df["VAL1"]

A    41
B    21
C    10
D    18
E    20
F    19
G    38
H    19
I    10
J    43
Name: VAL1, dtype: int32

In [113]:
df["VAL1"] < 20

A    False
B    False
C     True
D     True
E    False
F     True
G    False
H     True
I     True
J    False
Name: VAL1, dtype: bool

In [114]:
df[df["VAL1"] < 20]["VAL2"]

C    15
D    39
F    18
H    28
I    22
Name: VAL2, dtype: int32

In [115]:
df[df["VAL1"] < 20][["VAL2"]]

   VAL2
C    15
D    39
F    18
H    28
I    22

In [116]:
df[df["VAL1"] < 20][["VAL2","VAL5"]]

   VAL2  VAL5
C    15    29
D    39    29
F    18    45
H    28    25
I    22    25

In [117]:
df[(df["VAL1"] > 20 ) & (df["VAL4"] < 18)]

   VAL1  VAL2  VAL3  VAL4  VAL5
A    41    21    27    16    33
B    21    19    23    14    38

In [118]:
df[(df < 35) | (df["VAL5"] > 20)]

   VAL1  VAL2  VAL3  VAL4  VAL5
A   NaN  21.0  27.0  16.0  33.0
B  21.0  19.0  23.0  14.0   NaN
C  10.0  15.0  22.0   NaN  29.0
D  18.0   NaN   NaN  18.0  29.0
E  20.0  22.0   NaN  33.0  10.0
F  19.0  18.0   NaN  29.0   NaN
G   NaN  17.0  20.0   NaN   NaN
H  19.0  28.0  17.0   NaN  25.0
I  10.0  22.0  27.0  21.0  25.0
J   NaN   NaN  34.0   NaN  29.0

In [119]:
df.loc[df.VAL2 > 25 ,["VAL2","VAL3","VAL5"]]

   VAL2  VAL3  VAL5
D    39    44    29
H    28    17    25
J    39    34    29

# birleÅtirme

In [120]:
x = np.arange(0,28).reshape(7,4)

In [121]:
x

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19],
       [20, 21, 22, 23],
       [24, 25, 26, 27]])

In [122]:
df = pd.DataFrame(data= x ,columns="VAL1 VAL2 VAL3 VAL4".split())

In [123]:
df

   VAL1  VAL2  VAL3  VAL4
0     0     1     2     3
1     4     5     6     7
2     8     9    10    11
3    12    13    14    15
4    16    17    18    19
5    20    21    22    23
6    24    25    26    27

In [124]:
a = df["VAL1"]+df["VAL2"]

In [125]:
b = df.VAL1+df.VAL2

In [126]:
type(a)

pandas.core.series.Series

In [127]:
type(b)

pandas.core.series.Series

In [128]:
c = df[["VAL1"]]

In [129]:
type(c)

pandas.core.frame.DataFrame

In [130]:
d = df[["VAL1","VAL2"]]

In [131]:
type(d)

pandas.core.frame.DataFrame

In [132]:
a

0     1
1     9
2    17
3    25
4    33
5    41
6    49
dtype: int32

In [133]:
df["VAL5"] = a

In [134]:
df

   VAL1  VAL2  VAL3  VAL4  VAL5
0     0     1     2     3     1
1     4     5     6     7     9
2     8     9    10    11    17
3    12    13    14    15    25
4    16    17    18    19    33
5    20    21    22    23    41
6    24    25    26    27    49

In [135]:
e = df["VAL3"]*df["VAL4"]

In [136]:
e

0      6
1     42
2    110
3    210
4    342
5    506
6    702
dtype: int32

In [137]:
df["VAL6"] = e

In [138]:
df

   VAL1  VAL2  VAL3  VAL4  VAL5  VAL6
0     0     1     2     3     1     6
1     4     5     6     7     9    42
2     8     9    10    11    17   110
3    12    13    14    15    25   210
4    16    17    18    19    33   342
5    20    21    22    23    41   506
6    24    25    26    27    49   702

In [139]:
df["VAL7"] = np.arange(28,35)

In [140]:
df

   VAL1  VAL2  VAL3  VAL4  VAL5  VAL6  VAL7
0     0     1     2     3     1     6    28
1     4     5     6     7     9    42    29
2     8     9    10    11    17   110    30
3    12    13    14    15    25   210    31
4    16    17    18    19    33   342    32
5    20    21    22    23    41   506    33
6    24    25    26    27    49   702    34

In [141]:
df["VAL8"] = [35,36,37,38,39,40,41]

In [142]:
df

   VAL1  VAL2  VAL3  VAL4  VAL5  VAL6  VAL7  VAL8
0     0     1     2     3     1     6    28    35
1     4     5     6     7     9    42    29    36
2     8     9    10    11    17   110    30    37
3    12    13    14    15    25   210    31    38
4    16    17    18    19    33   342    32    39
5    20    21    22    23    41   506    33    40
6    24    25    26    27    49   702    34    41

In [143]:
x = np.arange(0,28).reshape(7,4)

In [144]:
df = pd.DataFrame(data= x ,columns="VAL1 VAL2 VAL3 VAL4".split())

In [145]:
df

   VAL1  VAL2  VAL3  VAL4
0     0     1     2     3
1     4     5     6     7
2     8     9    10    11
3    12    13    14    15
4    16    17    18    19
5    20    21    22    23
6    24    25    26    27

# drop

In [146]:
# drop fonksiyonu ile seÃ§tiÄimiz dÄ±ÅÄ±ndaki sÃ¼tunlarÄ± birleÅtirerek Ã§Ä±ktÄ± verir, ancak kaydetmez

In [147]:
df.drop(["VAL3","VAL4"],axis=1)

   VAL1  VAL2
0     0     1
1     4     5
2     8     9
3    12    13
4    16    17
5    20    21
6    24    25

In [148]:
df.drop(["VAL1","VAL4"],axis=1)

   VAL2  VAL3
0     1     2
1     5     6
2     9    10
3    13    14
4    17    18
5    21    22
6    25    26

In [149]:
df.drop(["VAL1","VAL3"],axis=1)

   VAL2  VAL4
0     1     3
1     5     7
2     9    11
3    13    15
4    17    19
5    21    23
6    25    27

In [150]:
df

   VAL1  VAL2  VAL3  VAL4
0     0     1     2     3
1     4     5     6     7
2     8     9    10    11
3    12    13    14    15
4    16    17    18    19
5    20    21    22    23
6    24    25    26    27

In [151]:
df.drop(["VAL1","VAL3","VAL4"],axis=1)

   VAL2
0     1
1     5
2     9
3    13
4    17
5    21
6    25

In [152]:
df.drop(["VAL2"],axis=1)

   VAL1  VAL3  VAL4
0     0     2     3
1     4     6     7
2     8    10    11
3    12    14    15
4    16    18    19
5    20    22    23
6    24    26    27

# DROP , Ä°NPLACE

In [153]:
# inplace = True ile yaptÄ±ÄÄ±mÄ±z deÄiÅikliÄi kaydeder

In [154]:
df.drop(["VAL2"],axis=1,inplace=True)

In [155]:
df

   VAL1  VAL3  VAL4
0     0     2     3
1     4     6     7
2     8    10    11
3    12    14    15
4    16    18    19
5    20    22    23
6    24    26    27

In [156]:
df.drop([2,5],axis=0)

   VAL1  VAL3  VAL4
0     0     2     3
1     4     6     7
3    12    14    15
4    16    18    19
6    24    26    27

In [157]:
df.drop([2,5,6],axis=0)

   VAL1  VAL3  VAL4
0     0     2     3
1     4     6     7
3    12    14    15
4    16    18    19

In [158]:
df.drop([2,3,5],axis=0,inplace=True)

In [159]:
df

   VAL1  VAL3  VAL4
0     0     2     3
1     4     6     7
4    16    18    19
6    24    26    27

# nan

In [160]:
df = pd.DataFrame({ "VAL1" : [2,4,np.nan,8,10]})

In [161]:
df

   VAL1
0   2.0
1   4.0
2   NaN
3   8.0
4  10.0

In [162]:
df = pd.DataFrame({ "VAL1" : [2,4,np.nan,6,np.nan,8,10],
                    "VAL2" : [123,np.nan,456,np.nan,789,246,357],
                    "VAL3" : ["France","Greece","USA","Japan","Sweden","Norway","Turkey"]})

In [163]:
df

   VAL1   VAL2    VAL3
0   2.0  123.0  France
1   4.0    NaN  Greece
2   NaN  456.0     USA
3   6.0    NaN   Japan
4   NaN  789.0  Sweden
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [164]:
df.isnull()

    VAL1   VAL2   VAL3
0  False  False  False
1  False   True  False
2   True  False  False
3  False   True  False
4   True  False  False
5  False  False  False
6  False  False  False

In [165]:
df.isnull().sum()

VAL1    2
VAL2    2
VAL3    0
dtype: int64

In [166]:
df.isnull().mean()

VAL1    0.285714
VAL2    0.285714
VAL3    0.000000
dtype: float64

In [167]:
df.isnull().mean()*100

VAL1    28.571429
VAL2    28.571429
VAL3     0.000000
dtype: float64

In [168]:
df.notnull()

    VAL1   VAL2  VAL3
0   True   True  True
1   True  False  True
2  False   True  True
3   True  False  True
4  False   True  True
5   True   True  True
6   True   True  True

In [169]:
df.notnull().sum()

VAL1    5
VAL2    5
VAL3    7
dtype: int64

In [170]:
df["VAL1"].notnull()

0     True
1     True
2    False
3     True
4    False
5     True
6     True
Name: VAL1, dtype: bool

In [171]:
df[df["VAL1"].notnull()]

   VAL1   VAL2    VAL3
0   2.0  123.0  France
1   4.0    NaN  Greece
3   6.0    NaN   Japan
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [172]:
df

   VAL1   VAL2    VAL3
0   2.0  123.0  France
1   4.0    NaN  Greece
2   NaN  456.0     USA
3   6.0    NaN   Japan
4   NaN  789.0  Sweden
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [173]:
df.isnull().any()

VAL1     True
VAL2     True
VAL3    False
dtype: bool

In [174]:
df.isnull().any(axis=1)

0    False
1     True
2     True
3     True
4     True
5    False
6    False
dtype: bool

In [175]:
condition = df.isnull().any(axis=1)

In [176]:
df[condition]

   VAL1   VAL2    VAL3
1   4.0    NaN  Greece
2   NaN  456.0     USA
3   6.0    NaN   Japan
4   NaN  789.0  Sweden

In [177]:
df[~condition]

   VAL1   VAL2    VAL3
0   2.0  123.0  France
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [178]:
df.notnull().all()

VAL1    False
VAL2    False
VAL3     True
dtype: bool

In [179]:
df.notnull().all(axis=1)

0     True
1    False
2    False
3    False
4    False
5     True
6     True
dtype: bool

In [180]:
df[df.notnull().all(axis=1)]

   VAL1   VAL2    VAL3
0   2.0  123.0  France
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

# dropna

In [181]:
df

   VAL1   VAL2    VAL3
0   2.0  123.0  France
1   4.0    NaN  Greece
2   NaN  456.0     USA
3   6.0    NaN   Japan
4   NaN  789.0  Sweden
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [182]:
df.dropna()

   VAL1   VAL2    VAL3
0   2.0  123.0  France
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [183]:
df.dropna(axis=1)

     VAL3
0  France
1  Greece
2     USA
3   Japan
4  Sweden
5  Norway
6  Turkey

In [184]:
df["VAL4"] = np.nan

In [185]:
df

   VAL1   VAL2    VAL3  VAL4
0   2.0  123.0  France   NaN
1   4.0    NaN  Greece   NaN
2   NaN  456.0     USA   NaN
3   6.0    NaN   Japan   NaN
4   NaN  789.0  Sweden   NaN
5   8.0  246.0  Norway   NaN
6  10.0  357.0  Turkey   NaN

In [186]:
df.dropna()

Empty DataFrame
Columns: [VAL1, VAL2, VAL3, VAL4]
Index: []

In [187]:
df.dropna(axis=1)

     VAL3
0  France
1  Greece
2     USA
3   Japan
4  Sweden
5  Norway
6  Turkey

In [188]:
df.dropna(how="all")

   VAL1   VAL2    VAL3  VAL4
0   2.0  123.0  France   NaN
1   4.0    NaN  Greece   NaN
2   NaN  456.0     USA   NaN
3   6.0    NaN   Japan   NaN
4   NaN  789.0  Sweden   NaN
5   8.0  246.0  Norway   NaN
6  10.0  357.0  Turkey   NaN

In [189]:
df.dropna(how="all",axis=1)

   VAL1   VAL2    VAL3
0   2.0  123.0  France
1   4.0    NaN  Greece
2   NaN  456.0     USA
3   6.0    NaN   Japan
4   NaN  789.0  Sweden
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [190]:
df = pd.DataFrame({ "VAL1" : [2,4,np.nan,6,np.nan,8,10],
                    "VAL2" : [123,np.nan,456,np.nan,789,246,357],
                    "VAL3" : ["France","Greece","USA","Japan","Sweden","Norway","Turkey"]})

In [191]:
df

   VAL1   VAL2    VAL3
0   2.0  123.0  France
1   4.0    NaN  Greece
2   NaN  456.0     USA
3   6.0    NaN   Japan
4   NaN  789.0  Sweden
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [192]:
df.fillna(10000)

      VAL1     VAL2    VAL3
0      2.0    123.0  France
1      4.0  10000.0  Greece
2  10000.0    456.0     USA
3      6.0  10000.0   Japan
4  10000.0    789.0  Sweden
5      8.0    246.0  Norway
6     10.0    357.0  Turkey

In [193]:
df["VAL1"].fillna(df["VAL1"].mean())

0     2.0
1     4.0
2     6.0
3     6.0
4     6.0
5     8.0
6    10.0
Name: VAL1, dtype: float64

In [194]:
df.fillna({"VAL1":10000,"VAL2":20000})

      VAL1     VAL2    VAL3
0      2.0    123.0  France
1      4.0  20000.0  Greece
2  10000.0    456.0     USA
3      6.0  20000.0   Japan
4  10000.0    789.0  Sweden
5      8.0    246.0  Norway
6     10.0    357.0  Turkey

In [195]:
df["VAL3"].fillna("Turkey")

0    France
1    Greece
2       USA
3     Japan
4    Sweden
5    Norway
6    Turkey
Name: VAL3, dtype: object

In [196]:
df

   VAL1   VAL2    VAL3
0   2.0  123.0  France
1   4.0    NaN  Greece
2   NaN  456.0     USA
3   6.0    NaN   Japan
4   NaN  789.0  Sweden
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [197]:
# ffill kendinden sonraki satÄ±ra kendi deÄerini verir.
df.fillna(method="ffill")

   VAL1   VAL2    VAL3
0   2.0  123.0  France
1   4.0  123.0  Greece
2   4.0  456.0     USA
3   6.0  456.0   Japan
4   6.0  789.0  Sweden
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [198]:
df

   VAL1   VAL2    VAL3
0   2.0  123.0  France
1   4.0    NaN  Greece
2   NaN  456.0     USA
3   6.0    NaN   Japan
4   NaN  789.0  Sweden
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [199]:
# pad kendinden sonraki satÄ±ra kendi deÄerini verir.
df.fillna(method="pad")

   VAL1   VAL2    VAL3
0   2.0  123.0  France
1   4.0  123.0  Greece
2   4.0  456.0     USA
3   6.0  456.0   Japan
4   6.0  789.0  Sweden
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [200]:
df

   VAL1   VAL2    VAL3
0   2.0  123.0  France
1   4.0    NaN  Greece
2   NaN  456.0     USA
3   6.0    NaN   Japan
4   NaN  789.0  Sweden
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [201]:
# bfill kendinden Ã¶nceki satÄ±ra kendi deÄerini verir.
df.fillna(method="bfill")

   VAL1   VAL2    VAL3
0   2.0  123.0  France
1   4.0  456.0  Greece
2   6.0  456.0     USA
3   6.0  789.0   Japan
4   8.0  789.0  Sweden
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [202]:
df

   VAL1   VAL2    VAL3
0   2.0  123.0  France
1   4.0    NaN  Greece
2   NaN  456.0     USA
3   6.0    NaN   Japan
4   NaN  789.0  Sweden
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [203]:
# backfill kendinden Ã¶nceki satÄ±ra kendi deÄerini verir.
df.fillna(method="backfill")

   VAL1   VAL2    VAL3
0   2.0  123.0  France
1   4.0  456.0  Greece
2   6.0  456.0     USA
3   6.0  789.0   Japan
4   8.0  789.0  Sweden
5   8.0  246.0  Norway
6  10.0  357.0  Turkey

In [204]:
np.random.seed(101)
df = pd.DataFrame(data=np.random.randn(6,5),index="A B C D E F".split(),columns="VAL1 VAL2 VAL3 VAL4 VAL5".split())

In [205]:
df

       VAL1      VAL2      VAL3      VAL4      VAL5
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841
F  0.390528  0.166905  0.184502  0.807706  0.072960

In [206]:
df.reset_index()

  index      VAL1      VAL2      VAL3      VAL4      VAL5
0     A  2.706850  0.628133  0.907969  0.503826  0.651118
1     B -0.319318 -0.848077  0.605965 -2.018168  0.740122
2     C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
3     D  0.955057  0.190794  1.978757  2.605967  0.683509
4     E  0.302665  1.693723 -1.706086 -1.159119 -0.134841
5     F  0.390528  0.166905  0.184502  0.807706  0.072960

In [207]:
df

       VAL1      VAL2      VAL3      VAL4      VAL5
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841
F  0.390528  0.166905  0.184502  0.807706  0.072960

In [208]:
df.reset_index(inplace=True)

In [209]:
df

  index      VAL1      VAL2      VAL3      VAL4      VAL5
0     A  2.706850  0.628133  0.907969  0.503826  0.651118
1     B -0.319318 -0.848077  0.605965 -2.018168  0.740122
2     C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
3     D  0.955057  0.190794  1.978757  2.605967  0.683509
4     E  0.302665  1.693723 -1.706086 -1.159119 -0.134841
5     F  0.390528  0.166905  0.184502  0.807706  0.072960

In [210]:
example = "TR F NL RUS AUS AZ".split()

In [211]:
example

['TR', 'F', 'NL', 'RUS', 'AUS', 'AZ']

In [212]:
df["new_index"] = example

In [213]:
df

  index      VAL1      VAL2      VAL3      VAL4      VAL5 new_index
0     A  2.706850  0.628133  0.907969  0.503826  0.651118        TR
1     B -0.319318 -0.848077  0.605965 -2.018168  0.740122         F
2     C  0.528813 -0.589001  0.188695 -0.758872 -0.933237        NL
3     D  0.955057  0.190794  1.978757  2.605967  0.683509       RUS
4     E  0.302665  1.693723 -1.706086 -1.159119 -0.134841       AUS
5     F  0.390528  0.166905  0.184502  0.807706  0.072960        AZ

In [214]:
df.set_index("new_index")

          index      VAL1      VAL2      VAL3      VAL4      VAL5
new_index
TR            A  2.706850  0.628133  0.907969  0.503826  0.651118
F             B -0.319318 -0.848077  0.605965 -2.018168  0.740122
NL            C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
RUS           D  0.955057  0.190794  1.978757  2.605967  0.683509
AUS           E  0.302665  1.693723 -1.706086 -1.159119 -0.134841
AZ            F  0.390528  0.166905  0.184502  0.807706  0.072960

In [215]:
df.set_index("new_index",inplace=True)

In [216]:
df

          index      VAL1      VAL2      VAL3      VAL4      VAL5
new_index
TR            A  2.706850  0.628133  0.907969  0.503826  0.651118
F             B -0.319318 -0.848077  0.605965 -2.018168  0.740122
NL            C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
RUS           D  0.955057  0.190794  1.978757  2.605967  0.683509
AUS           E  0.302665  1.693723 -1.706086 -1.159119 -0.134841
AZ            F  0.390528  0.166905  0.184502  0.807706  0.072960

In [217]:
inside = ["class A","class B","class C","class A","class B","class C"]
outside = ["school 1","school 1","school 1","school 2","school 2","school 2"]

In [218]:
zip(outside,inside)

In [219]:
multi_index = list(zip(outside,inside))

In [220]:
multi_index

[('school 1', 'class A'),
 ('school 1', 'class B'),
 ('school 1', 'class C'),
 ('school 2', 'class A'),
 ('school 2', 'class B'),
 ('school 2', 'class C')]

In [221]:
hier_index = pd.MultiIndex.from_tuples(multi_index)

In [222]:
hier_index

MultiIndex([('school 1', 'class A'),
            ('school 1', 'class B'),
            ('school 1', 'class C'),
            ('school 2', 'class A'),
            ('school 2', 'class B'),
            ('school 2', 'class C')],
           )

In [223]:
np.random.seed(101)
df = pd.DataFrame(data=np.random.randint(70,100,size=(6,2)),index=hier_index,columns=["1st_semester","2st_semester"])

In [224]:
df

                  1st_semester  2st_semester
school 1 class A            81            87
         class B            76            93
         class C            99            81
school 2 class A            85            79
         class B            83            78
         class C            74            78

In [225]:
df.loc["school 1"]

         1st_semester  2st_semester
class A            81            87
class B            76            93
class C            99            81

In [226]:
df.loc["school 1"].loc["class B"]

1st_semester    76
2st_semester    93
Name: class B, dtype: int32

In [227]:
df.index.names = ["schools","classes"]

In [228]:
df

                  1st_semester  2st_semester
schools  classes
school 1 class A            81            87
         class B            76            93
         class C            99            81
school 2 class A            85            79
         class B            83            78
         class C            74            78

In [229]:
inside = ["class A","class B","class C","class A","class B","class C"]
outside = ["school 1","school 1","school 1","school 2","school 2","school 2"]
multi_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(multi_index)
np.random.seed(101)
df = pd.DataFrame(data=np.random.randint(70,100,size=(6,2)),index=hier_index,columns=["1st_semester","2st_semester"])
df.index.names = ["schools","classes"]

In [230]:
df

                  1st_semester  2st_semester
schools  classes
school 1 class A            81            87
         class B            76            93
         class C            99            81
school 2 class A            85            79
         class B            83            78
         class C            74            78

In [231]:
df.xs("school 2")

         1st_semester  2st_semester
classes
class A            85            79
class B            83            78
class C            74            78

In [232]:
df.xs(("school 2","class A"), level = [0,1])

                  1st_semester  2st_semester
schools  classes
school 2 class A            85            79

In [233]:
df

                  1st_semester  2st_semester
schools  classes
school 1 class A            81            87
         class B            76            93
         class C            99            81
school 2 class A            85            79
         class B            83            78
         class C            74            78

In [234]:
df.xs("class A",level="classes")

          1st_semester  2st_semester
schools
school 1            81            87
school 2            85            79

# concat

In [235]:
df1 = pd.DataFrame({"X" : ["X0","X1","X2","X3"],
                    "Y" : ["Y0","Y1","Y2","Y3"],
                    "Z" : ["Z0","Z1","Z2","Z3"],
                    "T" : ["T0","T1","T2","T3"]})

df2 = pd.DataFrame({"X" : ["X4","X5","X6","X7"],
                    "Y" : ["Y4","Y5","Y6","Y7"],
                    "Z" : ["Z4","Z5","Z6","Z7"],
                    "T" : ["T4","T5","T6","T7"]})

df3 = pd.DataFrame({"X" : ["X8","X9","X10","X11"],
                    "Y" : ["Y8","Y9","Y10","Y11"],
                    "Z" : ["Z8","Z9","Z10","Z11"],
                    "T" : ["T8","T9","T10","T11"]})

In [236]:
pd.concat([df1,df2,df3])

     X    Y    Z    T
0   X0   Y0   Z0   T0
1   X1   Y1   Z1   T1
2   X2   Y2   Z2   T2
3   X3   Y3   Z3   T3
0   X4   Y4   Z4   T4
1   X5   Y5   Z5   T5
2   X6   Y6   Z6   T6
3   X7   Y7   Z7   T7
0   X8   Y8   Z8   T8
1   X9   Y9   Z9   T9
2  X10  Y10  Z10  T10
3  X11  Y11  Z11  T11

In [237]:
pd.concat([df1,df2,df3],ignore_index=True)

      X    Y    Z    T
0    X0   Y0   Z0   T0
1    X1   Y1   Z1   T1
2    X2   Y2   Z2   T2
3    X3   Y3   Z3   T3
4    X4   Y4   Z4   T4
5    X5   Y5   Z5   T5
6    X6   Y6   Z6   T6
7    X7   Y7   Z7   T7
8    X8   Y8   Z8   T8
9    X9   Y9   Z9   T9
10  X10  Y10  Z10  T10
11  X11  Y11  Z11  T11

In [238]:
df2.columns = ["X","Y","Z","A"]

In [239]:
df2

    X   Y   Z   A
0  X4  Y4  Z4  T4
1  X5  Y5  Z5  T5
2  X6  Y6  Z6  T6
3  X7  Y7  Z7  T7

In [240]:
pd.concat([df1,df2],ignore_index = True)

    X   Y   Z    T    A
0  X0  Y0  Z0   T0  NaN
1  X1  Y1  Z1   T1  NaN
2  X2  Y2  Z2   T2  NaN
3  X3  Y3  Z3   T3  NaN
4  X4  Y4  Z4  NaN   T4
5  X5  Y5  Z5  NaN   T5
6  X6  Y6  Z6  NaN   T6
7  X7  Y7  Z7  NaN   T7

In [241]:
pd.concat([df1,df2],ignore_index = True,join="inner")

    X   Y   Z
0  X0  Y0  Z0
1  X1  Y1  Z1
2  X2  Y2  Z2
3  X3  Y3  Z3
4  X4  Y4  Z4
5  X5  Y5  Z5
6  X6  Y6  Z6
7  X7  Y7  Z7

In [242]:
pd.concat([df1,df2,df3],axis=1)

    X   Y   Z   T   X   Y   Z   A    X    Y    Z    T
0  X0  Y0  Z0  T0  X4  Y4  Z4  T4   X8   Y8   Z8   T8
1  X1  Y1  Z1  T1  X5  Y5  Z5  T5   X9   Y9   Z9   T9
2  X2  Y2  Z2  T2  X6  Y6  Z6  T6  X10  Y10  Z10  T10
3  X3  Y3  Z3  T3  X7  Y7  Z7  T7  X11  Y11  Z11  T11

In [243]:
df1 = pd.DataFrame({"X" : ["X0","X1","X2","X3"],
                    "Y" : ["Y0","Y1","Y2","Y3"],
                    "Z" : ["Z0","Z1","Z2","Z3"],
                    "T" : ["T0","T1","T2","T3"]},
                  index = [1,2,3,4])

df2 = pd.DataFrame({"X" : ["X4","X5","X6","X7"],
                    "Y" : ["Y4","Y5","Y6","Y7"],
                    "Z" : ["Z4","Z5","Z6","Z7"],
                    "T" : ["T4","T5","T6","T7"]},
                  index = [5,6,7,8])

df3 = pd.DataFrame({"X" : ["X8","X9","X10","X11"],
                    "Y" : ["Y8","Y9","Y10","Y11"],
                    "Z" : ["Z8","Z9","Z10","Z11"],
                    "T" : ["T8","T9","T10","T11"]},
                  index = [9,10,11,12])

In [244]:
pd.concat([df1,df2,df3],axis=1)

      X    Y    Z    T    X    Y    Z    T    X    Y    Z    T
1    X0   Y0   Z0   T0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    X1   Y1   Z1   T1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    X2   Y2   Z2   T2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4    X3   Y3   Z3   T3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   X4   Y4   Z4   T4  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   X5   Y5   Z5   T5  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   X6   Y6   Z6   T6  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN   X7   Y7   Z7   T7  NaN  NaN  NaN  NaN
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   X8   Y8   Z8   T8
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   X9   Y9   Z9   T9
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  X10  Y10  Z10  T10
12  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  X11  Y11  Z11  T11

In [245]:
pd.concat([df1,df2,df3],axis=0)

      X    Y    Z    T
1    X0   Y0   Z0   T0
2    X1   Y1   Z1   T1
3    X2   Y2   Z2   T2
4    X3   Y3   Z3   T3
5    X4   Y4   Z4   T4
6    X5   Y5   Z5   T5
7    X6   Y6   Z6   T6
8    X7   Y7   Z7   T7
9    X8   Y8   Z8   T8
10   X9   Y9   Z9   T9
11  X10  Y10  Z10  T10
12  X11  Y11  Z11  T11

In [246]:
pd.concat([df1,df2,df3],axis=1,join="inner")

Empty DataFrame
Columns: [X, Y, Z, T, X, Y, Z, T, X, Y, Z, T]
Index: []

In [247]:
df1 = pd.DataFrame({"employee" : ["Julia","Marie","Adam","Nicole"],
                    "department" : ["Data Science","Web Development","Data Science","Cyber Security"],
                    "year" : ["2005","2008","2011","2002"]})

df2 = pd.DataFrame({"employee" : ["Nicole","Adam","Julia","Marie"],
                    "country" : ["Canada","England","USA","Germany"],
                    "salary" : ["22000","16000","20000","18000"]})

In [248]:
df1

  employee       department  year
0    Julia     Data Science  2005
1    Marie  Web Development  2008
2     Adam     Data Science  2011
3   Nicole   Cyber Security  2002

In [249]:
df2

  employee  country salary
0   Nicole   Canada  22000
1     Adam  England  16000
2    Julia      USA  20000
3    Marie  Germany  18000

In [250]:
pd.concat([df1,df2])

  employee       department  year  country salary
0    Julia     Data Science  2005      NaN    NaN
1    Marie  Web Development  2008      NaN    NaN
2     Adam     Data Science  2011      NaN    NaN
3   Nicole   Cyber Security  2002      NaN    NaN
0   Nicole              NaN   NaN   Canada  22000
1     Adam              NaN   NaN  England  16000
2    Julia              NaN   NaN      USA  20000
3    Marie              NaN   NaN  Germany  18000

In [251]:
pd.concat([df1,df2],axis=1)

  employee       department  year employee  country salary
0    Julia     Data Science  2005   Nicole   Canada  22000
1    Marie  Web Development  2008     Adam  England  16000
2     Adam     Data Science  2011    Julia      USA  20000
3   Nicole   Cyber Security  2002    Marie  Germany  18000

In [252]:
pd.merge(df1,df2)

  employee       department  year  country salary
0    Julia     Data Science  2005      USA  20000
1    Marie  Web Development  2008  Germany  18000
2     Adam     Data Science  2011  England  16000
3   Nicole   Cyber Security  2002   Canada  22000

In [253]:
pd.merge(df1,df2, on="employee")

  employee       department  year  country salary
0    Julia     Data Science  2005      USA  20000
1    Marie  Web Development  2008  Germany  18000
2     Adam     Data Science  2011  England  16000
3   Nicole   Cyber Security  2002   Canada  22000

In [254]:
pd.merge(df1,df2, on="employee",how = "left")

  employee       department  year  country salary
0    Julia     Data Science  2005      USA  20000
1    Marie  Web Development  2008  Germany  18000
2     Adam     Data Science  2011  England  16000
3   Nicole   Cyber Security  2002   Canada  22000

In [255]:
pd.merge(df1,df2, on="employee",how = "right")

  employee       department  year  country salary
0   Nicole   Cyber Security  2002   Canada  22000
1     Adam     Data Science  2011  England  16000
2    Julia     Data Science  2005      USA  20000
3    Marie  Web Development  2008  Germany  18000

In [256]:
df1 = pd.DataFrame({"employee" : ["Julia","Marie","Adam","Nicole"],
                    "department" : ["Data Science","Web Development","Data Science","Cyber Security"],
                    "year" : ["2005","2008","2011","2002"]})

df2 = pd.DataFrame({"employee" : ["Nicole","Adam","Julia","Marie"],
                    "country" : ["Canada","England","USA","Germany"],
                    "salary" : ["22000","16000","20000","18000"]})

df3 = pd.DataFrame({"manager" : ["Abraham","Joseph","Kayra"],
                    "department" : ["Web Development","Cyber Security","Data Science"]})

In [257]:
df4 = pd.merge(df1,df2)

In [258]:
df4

  employee       department  year  country salary
0    Julia     Data Science  2005      USA  20000
1    Marie  Web Development  2008  Germany  18000
2     Adam     Data Science  2011  England  16000
3   Nicole   Cyber Security  2002   Canada  22000

In [259]:
pd.merge(df4,df3, on="department",how = "right")

  employee       department  year  country salary  manager
0    Marie  Web Development  2008  Germany  18000  Abraham
1   Nicole   Cyber Security  2002   Canada  22000   Joseph
2    Julia     Data Science  2005      USA  20000    Kayra
3     Adam     Data Science  2011  England  16000    Kayra

In [260]:
df5 = pd.merge(df4,df3, on="department",how = "right")

In [261]:
df6 = pd.DataFrame({"department" : ["Web Development","Web Development","Cyber Security","Cyber Security",
                                    "Data Science","Data Science"],
                   "prog_lang" : ["HTML","CSS","C++","SQL","PYHTON","R"]})

In [262]:
df6

        department prog_lang
0  Web Development      HTML
1  Web Development       CSS
2   Cyber Security       C++
3   Cyber Security       SQL
4     Data Science    PYHTON
5     Data Science         R

In [263]:
df5

  employee       department  year  country salary  manager
0    Marie  Web Development  2008  Germany  18000  Abraham
1   Nicole   Cyber Security  2002   Canada  22000   Joseph
2    Julia     Data Science  2005      USA  20000    Kayra
3     Adam     Data Science  2011  England  16000    Kayra

In [264]:
pd.merge(df5,df6)

  employee       department  year  country salary  manager prog_lang
0    Marie  Web Development  2008  Germany  18000  Abraham      HTML
1    Marie  Web Development  2008  Germany  18000  Abraham       CSS
2   Nicole   Cyber Security  2002   Canada  22000   Joseph       C++
3   Nicole   Cyber Security  2002   Canada  22000   Joseph       SQL
4    Julia     Data Science  2005      USA  20000    Kayra    PYHTON
5    Julia     Data Science  2005      USA  20000    Kayra         R
6     Adam     Data Science  2011  England  16000    Kayra    PYHTON
7     Adam     Data Science  2011  England  16000    Kayra         R

In [265]:
df1 = pd.DataFrame({"employee" : ["Julia","Marie","Adam","Nicole"],
                    "department" : ["Data Science","Web Development","Data Science","Cyber Security"],
                    "year" : ["2005","2008","2011","2002"]})

df2 = pd.DataFrame({"employee" : ["Nicole","Adam","Julia","Marie"],
                    "country" : ["Canada","England","USA","Germany"],
                    "salary" : ["22000","16000","20000","18000"]})

df3 = pd.merge(df1,df2)

df4 = pd.DataFrame({"employee" : ["Julia","Alex","Adam","Kayra"],
                    "department" : ["Data Science","Web Development","Data Science","Cyber Security"],
                    "univercity" : ["harvard","hamburg","oxford","metu"]})

In [266]:
df4

  employee       department univercity
0    Julia     Data Science    harvard
1     Alex  Web Development    hamburg
2     Adam     Data Science     oxford
3    Kayra   Cyber Security       metu

In [267]:
df3

  employee       department  year  country salary
0    Julia     Data Science  2005      USA  20000
1    Marie  Web Development  2008  Germany  18000
2     Adam     Data Science  2011  England  16000
3   Nicole   Cyber Security  2002   Canada  22000

In [268]:
df4

  employee       department univercity
0    Julia     Data Science    harvard
1     Alex  Web Development    hamburg
2     Adam     Data Science     oxford
3    Kayra   Cyber Security       metu

In [269]:
pd.merge(df3,df4,on = ["employee","department"])

  employee    department  year  country salary univercity
0    Julia  Data Science  2005      USA  20000    harvard
1     Adam  Data Science  2011  England  16000     oxford

In [270]:
pd.merge(df3,df4,on = ["employee","department"],how = "outer")

  employee       department  year  country salary univercity
0    Julia     Data Science  2005      USA  20000    harvard
1    Marie  Web Development  2008  Germany  18000        NaN
2     Adam     Data Science  2011  England  16000     oxford
3   Nicole   Cyber Security  2002   Canada  22000        NaN
4     Alex  Web Development   NaN      NaN    NaN    hamburg
5    Kayra   Cyber Security   NaN      NaN    NaN       metu

In [271]:
pd.merge(df3,df4,on = ["employee","department"],how = "left")

  employee       department  year  country salary univercity
0    Julia     Data Science  2005      USA  20000    harvard
1    Marie  Web Development  2008  Germany  18000        NaN
2     Adam     Data Science  2011  England  16000     oxford
3   Nicole   Cyber Security  2002   Canada  22000        NaN

In [272]:
pd.merge(df3,df4,on = ["employee","department"],how = "right")

  employee       department  year  country salary univercity
0    Julia     Data Science  2005      USA  20000    harvard
1     Alex  Web Development   NaN      NaN    NaN    hamburg
2     Adam     Data Science  2011  England  16000     oxford
3    Kayra   Cyber Security   NaN      NaN    NaN       metu

In [273]:
df6 = pd.DataFrame({"employee" : ["Alex","Sergio","Orhan","Fabian"],
                    "department" : ["Data Science","Web Development","Data Science","Cyber Security"],
                    "year" : ["2005","2009","2010","2002"],
                    "country" : ["Sweden","Poland","Turkey","France"],
                    "salary" : ["21000","18000","19500","22500"],
                    "experience" : ["5","9","3","2"]})

In [274]:
df3

  employee       department  year  country salary
0    Julia     Data Science  2005      USA  20000
1    Marie  Web Development  2008  Germany  18000
2     Adam     Data Science  2011  England  16000
3   Nicole   Cyber Security  2002   Canada  22000

In [275]:
df6

  employee       department  year country salary experience
0     Alex     Data Science  2005  Sweden  21000          5
1   Sergio  Web Development  2009  Poland  18000          9
2    Orhan     Data Science  2010  Turkey  19500          3
3   Fabian   Cyber Security  2002  France  22500          2

In [276]:
pd.merge(df3,df6,on=["department","year"])

,employee_x,department,year,country_x,salary_x,employee_y,country_y,salary_y,experience
0,Julia,Data Science,2005,USA,20000,Alex,Sweden,21000,5
1,Nicole,Cyber Security,2002,Canada,22000,Fabian,France,22500,2

In [277]:
pd.merge(df3,df6,on=["department","year"],how="outer")

,employee_x,department,year,country_x,salary_x,employee_y,country_y,salary_y,experience
0,Julia,Data Science,2005,USA,20000,Alex,Sweden,21000,5
1,Marie,Web Development,2008,Germany,18000,NaN,NaN,NaN,NaN
2,Adam,Data Science,2011,England,16000,NaN,NaN,NaN,NaN
3,Nicole,Cyber Security,2002,Canada,22000,Fabian,France,22500,2
4,NaN,Web Development,2009,NaN,NaN,Sergio,Poland,18000,9
5,NaN,Data Science,2010,NaN,NaN,Orhan,Turkey,19500,3

In [278]:
pd.merge(df3,df6,on=["department","year"],how="left")

,employee_x,department,year,country_x,salary_x,employee_y,country_y,salary_y,experience
0,Julia,Data Science,2005,USA,20000,Alex,Sweden,21000,5
1,Marie,Web Development,2008,Germany,18000,NaN,NaN,NaN,NaN
2,Adam,Data Science,2011,England,16000,NaN,NaN,NaN,NaN
3,Nicole,Cyber Security,2002,Canada,22000,Fabian,France,22500,2

In [279]:
df5 = pd.DataFrame({"member" : ["George","Marie","Nicole","Donald"],
                   "family_member" : ["4","5","1","3"]})

In [280]:
df5

   member family_member
0  George             4
1   Marie             5
2  Nicole             1
3  Donald             3

In [281]:
pd.merge(df3,df5,left_on ="employee",right_on="member")

  employee       department  year  country salary  member family_member
0    Marie  Web Development  2008  Germany  18000   Marie             5
1   Nicole   Cyber Security  2002   Canada  22000  Nicole             1

# join

In [282]:
df1 = pd.DataFrame({"X" : ["X0","X1","X2"],
                    "Y" : ["Y0","Y1","Y2"]},
                     index = ["A0","A1","A2"])
                    
df2 = pd.DataFrame({"Z" : ["Z0","Z1","Z2"],
                    "T" : ["T0","T1","T2"]},
                     index = ["A0","A1","A2"])

In [283]:
df1

     X   Y
A0  X0  Y0
A1  X1  Y1
A2  X2  Y2

In [284]:
df2

     Z   T
A0  Z0  T0
A1  Z1  T1
A2  Z2  T2

In [285]:
df1.join(df2)

     X   Y   Z   T
A0  X0  Y0  Z0  T0
A1  X1  Y1  Z1  T1
A2  X2  Y2  Z2  T2

In [286]:
df2.join(df1)

     Z   T   X   Y
A0  Z0  T0  X0  Y0
A1  Z1  T1  X1  Y1
A2  Z2  T2  X2  Y2